artillery_result_1_console_log.txt
Phase started: unnamed (index: 0, duration: 1s) 23:44:27(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 23:44:28(-0300)

--------------------------------------
Metrics for period to: 23:44:30(-0300) (width: 1.121s)
--------------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 898/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 40
  median: ...................................................................... 12.1
  p95: ......................................................................... 21.1
  p99: ......................................................................... 37
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.session_length:
  min: ......................................................................... 142
  max: ......................................................................... 321.3
  median: ...................................................................... 278.7
  p95: ......................................................................... 314.2
  p99: ......................................................................... 320.6


All VUs finished. Total time: 2 seconds

--------------------------------
Summary report @ 23:44:29(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 898/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 40
  median: ...................................................................... 12.1
  p95: ......................................................................... 21.1
  p99: ......................................................................... 37
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.session_length:
  min: ......................................................................... 142
  max: ......................................................................... 321.3
  median: ...................................................................... 278.7
  p95: ......................................................................... 314.2
  p99: ......................................................................... 320.6