artillery_result_no_console_log.txt
Phase started: unnamed (index: 0, duration: 1s) 23:47:01(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 23:47:02(-0300)

--------------------------------------
Metrics for period to: 23:47:10(-0300) (width: 1.026s)
--------------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 981/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 34
  median: ...................................................................... 7.9
  p95: ......................................................................... 13.1
  p99: ......................................................................... 16
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.session_length:
  min: ......................................................................... 46.8
  max: ......................................................................... 229.5
  median: ...................................................................... 175.9
  p95: ......................................................................... 219.2
  p99: ......................................................................... 223.7


All VUs finished. Total time: 2 seconds

--------------------------------
Summary report @ 23:47:03(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 981/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 34
  median: ...................................................................... 7.9
  p95: ......................................................................... 13.1
  p99: ......................................................................... 16
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.session_length:
  min: ......................................................................... 46.8
  max: ......................................................................... 229.5
  median: ...................................................................... 175.9
  p95: ......................................................................... 219.2
  p99: ......................................................................... 223.7